Amiya200/stm32_water_tank/Core/Src/screen.c
        case UI_AUTO_EDIT_GAP:
            snprintf(l0,sizeof(l0),"Gap: %us",edit_auto_gap_s);
            lcd_line0(l0);
            lcd_line1("UP/DN  Next");
            break;

        case UI_AUTO_EDIT_MAXRUN:
            snprintf(l0,sizeof(l0),"MaxRun %umin",edit_auto_maxrun_min);
            lcd_line0(l0);
            lcd_line1("UP/DN  Next");
            break;

        case UI_AUTO_EDIT_RETRY:
            snprintf(l0,sizeof(l0),"Retry: %u",edit_auto_retry);
            lcd_line0(l0);
            lcd_line1("UP/DN  Save");
            break;

        default:
            break;
    }
}

static void show_semi_auto(void){
    char line0[17], line1[17];
    snprintf(line0,sizeof(line0),"Semi-Auto Mode");
    if (semiAutoEnabled) snprintf(line1,sizeof(line1),">Disable  Back");
    else snprintf(line1,sizeof(line1),">Enable   Back");
    lcd_line0(line0);
    lcd_line1(line1);
}

static void show_timer(void)
{
    char l0[17], l1[17];
    TimerSlot *ts = &timerSlots[currentSlot];
    snprintf(l0, sizeof(l0), "T%d %02d:%02d-%02d:%02d",
             currentSlot + 1, ts->onHour, ts->onMinute, ts->offHour, ts->offMinute);
    snprintf(l1, sizeof(l1), "EN:%s  Edit>Next",
             ts->enabled ? "Y" : "N");
    lcd_line0(l0);
    lcd_line1(l1);
}


static void apply_timer_slot(uint8_t slot)
{
    if (slot >= 5) return;
    TimerSlot *ts = &timerSlots[slot];
    ts->onHour    = edit_timer_on_h;
    ts->onMinute  = edit_timer_on_m;
    ts->offHour   = edit_timer_off_h;
    ts->offMinute = edit_timer_off_m;
    ts->enabled   = true;
}


static void show_countdown(void){
    char l0[17], l1[17];

    if (countdownActive) {
        uint32_t sec = countdownDuration;
        uint32_t min = sec / 60;
        uint32_t s   = sec % 60;

        snprintf(l0, sizeof(l0), "Time %02d:%02d", (int)min, (int)s);
        snprintf(l1, sizeof(l1), ">Stop     Back");
    }
    else {
        snprintf(l0, sizeof(l0), "Countdown Mode");
        snprintf(l1, sizeof(l1), ">Set      Back");
    }

    lcd_line0(l0);
    lcd_line1(l1);
}




static void show_twist(void){
    char l0[17], l1[17];

    const char* status = twistActive ? "ON " : "OFF";
    snprintf(l0,sizeof(l0),"Tw %s %2ds/%2ds",
             status,
             (int)twistSettings.onDurationSeconds,
             (int)twistSettings.offDurationSeconds);

    snprintf(l1,sizeof(l1),">%s   Edit",
             twistActive ? "Disable" : "Enable");

    lcd_line0(l0);
    lcd_line1(l1);
}


/* ===== Apply functions ===== */


static void apply_twist_settings(void)
{
    twistSettings.onDurationSeconds  = edit_twist_on_s;
    twistSettings.offDurationSeconds = edit_twist_off_s;

    twistSettings.onHour   = edit_twist_on_hh;
    twistSettings.onMinute = edit_twist_on_mm;
    twistSettings.offHour  = edit_twist_off_hh;
    twistSettings.offMinute= edit_twist_off_mm;
}

static void apply_countdown_settings(void){
    // kept for compatibility if other code depends on countdownDuration mirror
    countdownDuration = (uint32_t)edit_countdown_min * 60u;
}

static void enable_semi_auto(void){
    ModelHandle_ClearManualOverride();
    ModelHandle_StartSemiAuto();
    semiAutoEnabled = true;
}
static void disable_semi_auto(void){
    ModelHandle_SetMotor(false);
    semiAutoEnabled = false;
}

static void apply_timer_settings(void)
{
    if (currentSlot >= 5) return;

    timerSlots[currentSlot].enabled = true;
    timerSlots[currentSlot].onHour  = edit_timer_on_h;
    timerSlots[currentSlot].onMinute = edit_timer_on_m;
    timerSlots[currentSlot].offHour  = edit_timer_off_h;
    timerSlots[currentSlot].offMinute = edit_timer_off_m;

    /* 🔥 Immediately re-evaluate timer logic */
    extern void ModelHandle_TimerRecalculateNow(void);
    ModelHandle_TimerRecalculateNow();
}



void Screen_ShowCurrentMode(void)
{
}



/* ===== Initialization / Reset ===== */
void Screen_Init(void)
{
    lcd_init();
    ui = UI_WELCOME;
    last_ui = UI_MAX_;
    screenNeedsRefresh = true;
    lastLcdUpdateTime = HAL_GetTick();
    refreshInactivityTimer();

    /* --- Existing modes --- */
    edit_twist_on_s   = twistSettings.onDurationSeconds;
    edit_twist_off_s  = twistSettings.offDurationSeconds;

    edit_countdown_min = (uint16_t)(countdownDuration / 60u);
    if (edit_countdown_min == 0)
        edit_countdown_min = 5;
}

void Screen_ResetToHome(void){
    ui = UI_WELCOME;
    last_ui = UI_MAX_;
    screenNeedsRefresh = true;
    lastLcdUpdateTime = HAL_GetTick();
    refreshInactivityTimer();
}
/* ============================
   MENU SELECTION LOGIC
   ============================ */
/* ============================
   MENU SELECTION LOGIC
   ============================ */
/* ============================================================
   MENU SELECT (SW2 short press)
   ============================================================ */
static void menu_select(void)
{
    refreshInactivityTimer();

    switch (ui)
    {
        /* --------------------------
           WELCOME SCREEN
        --------------------------- */
        case UI_WELCOME:
            ui = UI_DASH;
            break;

        /* --------------------------
           DASHBOARD → MENU
        --------------------------- */
        case UI_DASH:
            ui = UI_MENU;
            goto_menu_top();
            break;

        /* ======================================================
           MAIN MENU ITEMS
           ====================================================== */
        case UI_MENU:
            switch (menu_idx)
            {
                /* ------------------------------------
                   0) TIMER MODE
                ------------------------------------- */
                case 0:
                    ui = UI_TIMER;
                    currentSlot = 0;

                    // Load slot into edit fields
                    edit_timer_on_h  = timerSlots[currentSlot].onHour;
                    edit_timer_on_m  = timerSlots[currentSlot].onMinute;
                    edit_timer_off_h = timerSlots[currentSlot].offHour;
                    edit_timer_off_m = timerSlots[currentSlot].offMinute;

                    break;

                /* ------------------------------------
                   1) AUTO MODE SETTINGS
                   ------------------------------------ */
                case 1:
                    ui = UI_AUTO_MENU;     // NOTE: create UI_AUTO_MENU if you want full editor
                    break;

                /* ------------------------------------
                   2) TWIST MODE
                   ------------------------------------ */
                case 2:
                    ui = UI_TWIST;
                    break;

                /* ------------------------------------
                   3) BACK → DASHBOARD
                   ------------------------------------ */
                case 3:
                    ui = UI_DASH;
                    break;

                default:
                    ui = UI_DASH;
                    break;
            }
            break;

        /* ======================================================
           MANUAL MODE (should not be in menu anymore)
           ====================================================== */
        case UI_MANUAL:
            ModelHandle_ToggleManual();
            screenNeedsRefresh = true;
            break;

        /* ======================================================
           SEMI-AUTO MODE
           ====================================================== */
        case UI_SEMI_AUTO:
            if (!semiAutoEnabled) enable_semi_auto();
            else disable_semi_auto();
            ui = UI_DASH;
            break;

        /* ======================================================
           TIMER MODE SLOT SELECT / EDIT FLOW
           ====================================================== */
        case UI_TIMER:
            // Timer state — short press does nothing
            break;

        case UI_TIMER_SLOT_SELECT:
            ui = UI_TIMER_EDIT_SLOT_ON_H;
            break;

