Amiya200/stm32_water_tank/Core/Src/screen.c
            /* ==== TIMER EDITING ==== */
            case UI_TIMER_SLOT_SELECT: {
                char l0[17], l1[17];
                snprintf(l0,sizeof(l0),"Select Slot:%d", currentSlot + 1);
                snprintf(l1,sizeof(l1),">Edit   Back");
                lcd_line0(l0); lcd_line1(l1);
                break;
            }

            case UI_TIMER_EDIT_SLOT_ON_H: {
                char l0[17], l1[17];
                snprintf(l0,sizeof(l0),"T%d ON Hour:%02d", currentSlot + 1, edit_timer_on_h);
                snprintf(l1,sizeof(l1),">UpDn   Next");
                lcd_line0(l0); lcd_line1(l1);
                break;
            }

            case UI_TIMER_EDIT_SLOT_ON_M: {
                char l0[17], l1[17];
                snprintf(l0,sizeof(l0),"T%d ON Min:%02d", currentSlot + 1, edit_timer_on_m);
                snprintf(l1,sizeof(l1),">UpDn   Next");
                lcd_line0(l0); lcd_line1(l1);
                break;
            }

            case UI_TIMER_EDIT_SLOT_OFF_H: {
                char l0[17], l1[17];
                snprintf(l0,sizeof(l0),"T%d OFF Hr:%02d", currentSlot + 1, edit_timer_off_h);
                snprintf(l1,sizeof(l1),">UpDn   Next");
                lcd_line0(l0); lcd_line1(l1);
                break;
            }

            case UI_TIMER_EDIT_SLOT_OFF_M: {
                char l0[17], l1[17];
                snprintf(l0,sizeof(l0),"T%d OFF Mn:%02d", currentSlot + 1, edit_timer_off_m);
                snprintf(l1,sizeof(l1),">UpDn   Next");
                lcd_line0(l0); lcd_line1(l1);
                break;
            }

            case UI_TIMER_EDIT_SLOT_ENABLE: {
                char l0[17], l1[17];
                snprintf(l0,sizeof(l0),"Enable Slot %d?", currentSlot + 1);
                snprintf(l1,sizeof(l1),">YES=Sel Back");
                lcd_line0(l0); lcd_line1(l1);
                break;
            }

            /* ==== SEARCH EDIT SCREENS (FIXED & PROPER) ==== */


            case UI_TWIST_EDIT_ON_H:
                lcd_line0("Twist ON Hour");
                snprintf(buf,16,">%02d", edit_twist_on_hh);
                lcd_line1(buf);
                break;

            case UI_TWIST_EDIT_ON_M:
                lcd_line0("Twist ON Min");
                snprintf(buf,16,">%02d", edit_twist_on_mm);
                lcd_line1(buf);
                break;

            case UI_TWIST_EDIT_OFF_H:
                lcd_line0("Twist OFF Hour");
                snprintf(buf,16,">%02d", edit_twist_off_hh);
                lcd_line1(buf);
                break;

            case UI_TWIST_EDIT_OFF_M:
                lcd_line0("Twist OFF Min");
                snprintf(buf,16,">%02d", edit_twist_off_mm);
                lcd_line1(buf);
                break;


            /* ==== COUNTDOWN ==== */
            case UI_COUNTDOWN_EDIT_MIN: {
                char l0[17], l1[17];
                snprintf(l0,sizeof(l0),"Set Min: %3u", edit_countdown_min);
                snprintf(l1,sizeof(l1),">UpDn   Next");
                lcd_line0(l0); lcd_line1(l1);
                break;
            }

            case UI_COUNTDOWN_TOGGLE: {
                char l0[17], l1[17];
                snprintf(l0,sizeof(l0),"Start Countdown?");
                snprintf(l1,sizeof(l1),">Yes     Back");
                lcd_line0(l0);
                lcd_line1(l1);
                break;
            }



            /* ==== TWIST ==== */
            case UI_TWIST_EDIT_ON: {
                char l0[17], l1[17];
                snprintf(l0,sizeof(l0),"Edit T ON:%3ds", edit_twist_on_s);
                snprintf(l1,sizeof(l1),">UpDn   Next");
                lcd_line0(l0); lcd_line1(l1);
                break;
            }

            case UI_TWIST_EDIT_OFF: {
                char l0[17], l1[17];
                snprintf(l0,sizeof(l0),"Edit T OFF:%3ds", edit_twist_off_s);
                snprintf(l1,sizeof(l1),">UpDn   Save");
                lcd_line0(l0); lcd_line1(l1);
                break;
            }

            default:
                lcd_line0("Not Implemented");
                lcd_line1("                ");
                break;
        }
    }
}

/* ============================
   BUTTON HANDLER
   ============================ */
static void increase_edit_value(void)
{
    switch (ui)
    {
        case UI_TIMER_EDIT_SLOT_ON_H:  if (++edit_timer_on_h  > 23) edit_timer_on_h = 0;  break;
        case UI_TIMER_EDIT_SLOT_ON_M:  if (++edit_timer_on_m  > 59) edit_timer_on_m = 0;  break;
        case UI_TIMER_EDIT_SLOT_OFF_H: if (++edit_timer_off_h > 23) edit_timer_off_h = 0; break;
        case UI_TIMER_EDIT_SLOT_OFF_M: if (++edit_timer_off_m > 59) edit_timer_off_m = 0; break;

        case UI_TWIST_EDIT_ON:    if (++edit_twist_on_s  > 999) edit_twist_on_s = 0;  break;
        case UI_TWIST_EDIT_OFF:   if (++edit_twist_off_s > 999) edit_twist_off_s = 0; break;

        case UI_COUNTDOWN_EDIT_MIN: if (++edit_countdown_min > 999) edit_countdown_min = 1; break;

        default: break;
    }
}

static void decrease_edit_value(void)
{
    switch (ui)
    {
        case UI_TIMER_EDIT_SLOT_ON_H:  if (edit_timer_on_h--  == 0) edit_timer_on_h  = 23; break;
        case UI_TIMER_EDIT_SLOT_ON_M:  if (edit_timer_on_m--  == 0) edit_timer_on_m  = 59; break;
        case UI_TIMER_EDIT_SLOT_OFF_H: if (edit_timer_off_h-- == 0) edit_timer_off_h = 23; break;
        case UI_TIMER_EDIT_SLOT_OFF_M: if (edit_timer_off_m-- == 0) edit_timer_off_m = 59; break;

        case UI_TWIST_EDIT_ON:    if (edit_twist_on_s--  == 0) edit_twist_on_s = 999;  break;
        case UI_TWIST_EDIT_OFF:   if (edit_twist_off_s-- == 0) edit_twist_off_s = 999; break;

        case UI_COUNTDOWN_EDIT_MIN: if (edit_countdown_min-- == 1) edit_countdown_min = 999; break;

        default: break;
    }
}

void Screen_HandleSwitches(void)
{
    static uint8_t last[4] = {1,1,1,1};
    static uint32_t pressT[4] = {0,0,0,0};

    uint32_t now = HAL_GetTick();

    bool inMenu = (ui == UI_MENU) ||
                  (ui >= UI_TIMER_SLOT_SELECT && ui <= UI_TWIST_EDIT_OFF_M) ||
                  (ui == UI_COUNTDOWN_EDIT_MIN);

    /* MAP BUTTONS */
    bool sw1 = (HAL_GPIO_ReadPin(SWITCH1_GPIO_Port, SWITCH1_Pin) == GPIO_PIN_RESET);
    bool sw2 = (HAL_GPIO_ReadPin(SWITCH2_GPIO_Port, SWITCH2_Pin) == GPIO_PIN_RESET);
    bool sw3 = (HAL_GPIO_ReadPin(SWITCH3_GPIO_Port, SWITCH3_Pin) == GPIO_PIN_RESET);
    bool sw4 = (HAL_GPIO_ReadPin(SWITCH4_GPIO_Port, SWITCH4_Pin) == GPIO_PIN_RESET);

    bool sw[4] = { sw1, sw2, sw3, sw4 };

    for (int i=0;i<4;i++)
    {
        if (sw[i] && last[i]) {        // pressed now, released last tick
            pressT[i] = now;
            last[i] = 0;
        }
        else if (!sw[i] && !last[i]) {  // released now
            uint32_t dur = now - pressT[i];
            last[i] = 1;

            /* ================================
               LONG PRESS (>=3s)
               ================================ */
            if (dur >= 3000)
            {
                if (inMenu)
                {
                    if (i==2) {     // UP long → continuous increase
                        cursorVisible = true;
                        // editing screens increase value
                    }
                    else if (i==3) { // DOWN long → continuous decrease
                        cursorVisible = true;
                    }
                }
                else
                {
                    /* NORMAL MODE LONG-PRESS ACTIONS */
                    if (i==0)      ModelHandle_ToggleManual();          // RED → Manual toggle
                    else if (i==1) ui = UI_MENU;                        // P → open menu
                    else if (i==2) ModelHandle_StartSemiAuto();         // UP → Semi Auto
                    else if (i==3) {                                    // DOWN → increase countdown
                        edit_countdown_min++;
                        apply_countdown_settings();
                    }
                }
                screenNeedsRefresh = true;
                continue;
            }

            /* ================================
               SHORT PRESS BEHAVIOR
               ================================ */
            if (inMenu)
            {
                /* ===== MENU MODE BUTTONS ===== */

