Amiya200/stm32_water_tank/Core/Src/screen.c
                if (i==0)      menu_reset();    // BACK
                else if (i==1) menu_select();   // SELECT
                else if (i==2) {                // UP
                    if (ui == UI_MENU) {
                        if (--menu_idx < 0) menu_idx = MAIN_MENU_COUNT - 1;
                    } else {
                        // Increase edit values
                        increase_edit_value();
                    }
                }
                else if (i==3) {                 // DOWN
                    if (ui == UI_MENU) {
                        if (++menu_idx >= MAIN_MENU_COUNT) menu_idx = 0;
                    } else {
                        // Decrease edit values
                        decrease_edit_value();
                    }
                }

                screenNeedsRefresh = true;
            }

            else
            {
                /* ===== NORMAL MODE BUTTONS ===== */

                if (i==0) {
                    // RED short press → restart pump
                    ModelHandle_StopAllModesAndMotor();
                    HAL_Delay(100);
                    ModelHandle_SetMotor(true);
                }
                else if (i==1) {
                    // AUTO toggle
                    ModelHandle_ToggleAuto();
                }
                else if (i==2) {
                    // Activate nearest timer slot
                    ModelHandle_StartNearestTimer();
                }
                else if (i==3) {
                    // Start countdown
                    ModelHandle_StartCountdown(edit_countdown_min*60, 0);
                }

                screenNeedsRefresh = true;
            }
        }
    }
}

/* ============================
   BUTTON HANDLER  (FIXED)
   ============================ */void Screen_HandleButton(UiButton b)
   {
       if (b == BTN_NONE) return;
       refreshInactivityTimer();

       /* ===========================
          SW1 SHORT → MANUAL TOGGLE
          =========================== */
       if (b == BTN_RESET) {
           ModelHandle_ToggleManual();
           screenNeedsRefresh = true;
           return;
       }


       /* ======================================================
          ======================= UP KEY ========================
          ====================================================== */
       if (b == BTN_UP)
       {
           switch (ui)
           {
               /* -------- MENU -------- */
               case UI_MENU:
                   if (menu_idx > 0) menu_idx--;
                   break;

               /* -------- TIMER MODE -------- */
               case UI_TIMER:
                   currentSlot = (currentSlot < 4) ? currentSlot + 1 : 0;
                   break;

               case UI_TIMER_EDIT_SLOT_ON_H:  if (edit_timer_on_h  < 23) edit_timer_on_h++;  break;
               case UI_TIMER_EDIT_SLOT_ON_M:  if (edit_timer_on_m  < 59) edit_timer_on_m++;  break;
               case UI_TIMER_EDIT_SLOT_OFF_H: if (edit_timer_off_h < 23) edit_timer_off_h++; break;
               case UI_TIMER_EDIT_SLOT_OFF_M: if (edit_timer_off_m < 59) edit_timer_off_m++; break;

               /* -------- COUNTDOWN EDIT -------- */
               case UI_COUNTDOWN_EDIT_MIN:  edit_countdown_min++; break;

               /* -------- TWIST EDIT -------- */
               case UI_TWIST_EDIT_ON:       if (edit_twist_on_s  < 999) edit_twist_on_s++;  break;
               case UI_TWIST_EDIT_OFF:      if (edit_twist_off_s < 999) edit_twist_off_s++; break;

               case UI_TWIST_EDIT_ON_H:     if (edit_twist_on_hh < 23) edit_twist_on_hh++;  break;
               case UI_TWIST_EDIT_ON_M:     if (edit_twist_on_mm < 59) edit_twist_on_mm++;  break;
               case UI_TWIST_EDIT_OFF_H:    if (edit_twist_off_hh < 23) edit_twist_off_hh++; break;
               case UI_TWIST_EDIT_OFF_M:    if (edit_twist_off_mm < 59) edit_twist_off_mm++; break;

               default: break;
           }

           screenNeedsRefresh = true;
           return;
       }


       /* ======================================================
          ===================== DOWN KEY ========================
          ====================================================== */
       if (b == BTN_DOWN)
       {
           switch (ui)
           {
               case UI_MENU:
                   if (menu_idx < (MAIN_MENU_COUNT - 1)) menu_idx++;
                   break;

               case UI_TIMER:
                   currentSlot = (currentSlot > 0) ? currentSlot - 1 : 4;
                   break;

               case UI_TIMER_EDIT_SLOT_ON_H:  if (edit_timer_on_h  > 0) edit_timer_on_h--;  break;
               case UI_TIMER_EDIT_SLOT_ON_M:  if (edit_timer_on_m  > 0) edit_timer_on_m--;  break;
               case UI_TIMER_EDIT_SLOT_OFF_H: if (edit_timer_off_h > 0) edit_timer_off_h--; break;
               case UI_TIMER_EDIT_SLOT_OFF_M: if (edit_timer_off_m > 0) edit_timer_off_m--; break;

               case UI_COUNTDOWN_EDIT_MIN:  if (edit_countdown_min > 1) edit_countdown_min--; break;

               case UI_TWIST_EDIT_ON:       if (edit_twist_on_s  > 1) edit_twist_on_s--;  break;
               case UI_TWIST_EDIT_OFF:      if (edit_twist_off_s > 1) edit_twist_off_s--; break;

               case UI_TWIST_EDIT_ON_H:     if (edit_twist_on_hh > 0) edit_twist_on_hh--;    break;
               case UI_TWIST_EDIT_ON_M:     if (edit_twist_on_mm > 0) edit_twist_on_mm--;    break;
               case UI_TWIST_EDIT_OFF_H:    if (edit_twist_off_hh > 0) edit_twist_off_hh--;  break;
               case UI_TWIST_EDIT_OFF_M:    if (edit_twist_off_mm > 0) edit_twist_off_mm--;  break;

               default: break;
           }

           screenNeedsRefresh = true;
           return;
       }


       /* ======================================================
          ===================== SELECT KEY ======================
          ====================================================== */
       if (b == BTN_SELECT)
       {
           switch (ui)
           {
               /* ----- TIMER FLOW ------ */
               case UI_TIMER:                 ui = UI_TIMER_SLOT_SELECT; break;
               case UI_TIMER_SLOT_SELECT:     ui = UI_TIMER_EDIT_SLOT_ON_H; break;
               case UI_TIMER_EDIT_SLOT_ON_H:  ui = UI_TIMER_EDIT_SLOT_ON_M; break;
               case UI_TIMER_EDIT_SLOT_ON_M:  ui = UI_TIMER_EDIT_SLOT_OFF_H; break;
               case UI_TIMER_EDIT_SLOT_OFF_H: ui = UI_TIMER_EDIT_SLOT_OFF_M; break;
               case UI_TIMER_EDIT_SLOT_OFF_M: ui = UI_TIMER_EDIT_SLOT_ENABLE; break;

               case UI_TIMER_EDIT_SLOT_ENABLE:
                   apply_timer_slot(currentSlot);
                   ui = UI_TIMER;
                   break;


               /* ----- TWIST FLOW ------ */
               case UI_TWIST: ui = UI_TWIST_EDIT_ON; break;
               case UI_TWIST_EDIT_ON:        ui = UI_TWIST_EDIT_OFF; break;
               case UI_TWIST_EDIT_OFF:       ui = UI_TWIST_EDIT_ON_H; break;
               case UI_TWIST_EDIT_ON_H:      ui = UI_TWIST_EDIT_ON_M; break;
               case UI_TWIST_EDIT_ON_M:      ui = UI_TWIST_EDIT_OFF_H; break;
               case UI_TWIST_EDIT_OFF_H:     ui = UI_TWIST_EDIT_OFF_M; break;

               case UI_TWIST_EDIT_OFF_M:
                   apply_twist_settings();
                   ModelHandle_StartTwist(
                       twistSettings.onDurationSeconds,
                       twistSettings.offDurationSeconds,
                       twistSettings.onHour,
                       twistSettings.onMinute,
                       twistSettings.offHour,
                       twistSettings.offMinute
                   );
                   ui = UI_TWIST;
                   break;

               /* ----- COUNTDOWN FLOW ------ */
               case UI_COUNTDOWN:
                   if (countdownActive) ModelHandle_StopCountdown();
                   else ui = UI_COUNTDOWN_EDIT_MIN;
                   break;

               case UI_COUNTDOWN_EDIT_MIN: ui = UI_COUNTDOWN_TOGGLE; break;

               case UI_COUNTDOWN_TOGGLE:
                   apply_countdown_settings();
                   ModelHandle_StartCountdown(edit_countdown_min * 60, 1);
                   ui = UI_COUNTDOWN;
                   break;

               /* ----- DEFAULT MENU ------ */
               default:
                   menu_select();
                   break;
           }

           screenNeedsRefresh = true;
           return;
       }
   }
